cases/2d_detonation_C7H16/constant/C6H14P
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    location    "";
    class       vectorField;
    object      C6H14P;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(1e-05 1e-05 0.00045)
(0.00050998 1e-05 0.00045)
(0.00100996 1e-05 0.00045)
(0.00150994 1e-05 0.00045)
(0.00200992 1e-05 0.00045)
(0.0025099 1e-05 0.00045)
(0.00300988 1e-05 0.00045)
(0.00350986 1e-05 0.00045)
(0.00400984 1e-05 0.00045)
(0.00450982 1e-05 0.00045)
(0.0050098 1e-05 0.00045)
(0.00550978 1e-05 0.00045)
(0.00600976 1e-05 0.00045)
(0.00650974 1e-05 0.00045)
(0.00700972 1e-05 0.00045)
(0.0075097 1e-05 0.00045)
(0.00800968 1e-05 0.00045)
(0.00850966 1e-05 0.00045)
(0.00900964 1e-05 0.00045)
(0.00950962 1e-05 0.00045)
(0.0100096 1e-05 0.00045)
(0.01050958 1e-05 0.00045)
(0.01100956 1e-05 0.00045)
(0.01150954 1e-05 0.00045)
(0.01200952 1e-05 0.00045)
(0.0125095 1e-05 0.00045)
(0.01300948 1e-05 0.00045)
(0.01350946 1e-05 0.00045)
(0.01400944 1e-05 0.00045)
(0.01450942 1e-05 0.00045)
(0.0150094 1e-05 0.00045)
(0.01550938 1e-05 0.00045)
(0.01600936 1e-05 0.00045)
(0.01650934 1e-05 0.00045)
(0.01700932 1e-05 0.00045)
(0.0175093 1e-05 0.00045)
(0.01800928 1e-05 0.00045)
(0.01850926 1e-05 0.00045)
(0.01900924 1e-05 0.00045)
(0.01950922 1e-05 0.00045)
(0.0200092 1e-05 0.00045)
(0.02050918 1e-05 0.00045)
(0.02100916 1e-05 0.00045)
(0.02150914 1e-05 0.00045)
(0.02200912 1e-05 0.00045)
(0.0225091 1e-05 0.00045)
(0.02300908 1e-05 0.00045)
(0.02350906 1e-05 0.00045)
(0.02400904 1e-05 0.00045)
(0.02450902 1e-05 0.00045)
(0.025009 1e-05 0.00045)
(0.02550898 1e-05 0.00045)
(0.02600896 1e-05 0.00045)
(0.02650894 1e-05 0.00045)
(0.02700892 1e-05 0.00045)
(0.0275089 1e-05 0.00045)
(0.02800888 1e-05 0.00045)
(0.02850886 1e-05 0.00045)
(0.02900884 1e-05 0.00045)
(0.02950882 1e-05 0.00045)
(0.0300088 1e-05 0.00045)
(0.03050878 1e-05 0.00045)
(0.03100876 1e-05 0.00045)
(0.03150874 1e-05 0.00045)
(0.03200872 1e-05 0.00045)
(0.0325087 1e-05 0.00045)
(0.03300868 1e-05 0.00045)
(0.03350866 1e-05 0.00045)
(0.03400864 1e-05 0.00045)
(0.03450862 1e-05 0.00045)
(0.0350086 1e-05 0.00045)
(0.03550858 1e-05 0.00045)
(0.03600856 1e-05 0.00045)
(0.03650854 1e-05 0.00045)
(0.03700852 1e-05 0.00045)
(0.0375085 1e-05 0.00045)
(0.03800848 1e-05 0.00045)
(0.03850846 1e-05 0.00045)
(0.03900844 1e-05 0.00045)
(0.03950842 1e-05 0.00045)
(0.0400084 1e-05 0.00045)
(0.04050838 1e-05 0.00045)
(0.04100836 1e-05 0.00045)
(0.04150834 1e-05 0.00045)
(0.04200832 1e-05 0.00045)
(0.0425083 1e-05 0.00045)
(0.04300828 1e-05 0.00045)
(0.04350826 1e-05 0.00045)
(0.04400824 1e-05 0.00045)
(0.04450822 1e-05 0.00045)
(0.0450082 1e-05 0.00045)
(0.04550818 1e-05 0.00045)
(0.04600816 1e-05 0.00045)
(0.04650814 1e-05 0.00045)
(0.04700812 1e-05 0.00045)
(0.0475081 1e-05 0.00045)
(0.04800808 1e-05 0.00045)
(0.04850806 1e-05 0.00045)
(0.04900804 1e-05 0.00045)
...
)
