cases/2d_detonation_C7H16/constant/back/C6H14P
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    location    "";
    class       vectorField;
    object      C6H14P;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(1e-05 1e-06 0.00045)
(0.000509995 1e-06 0.00045)
(0.00100999 1e-06 0.00045)
(0.001509985 1e-06 0.00045)
(0.00200998 1e-06 0.00045)
(0.002509975 1e-06 0.00045)
(0.00300997 1e-06 0.00045)
(0.003509965 1e-06 0.00045)
(0.00400996 1e-06 0.00045)
(0.004509955 1e-06 0.00045)
(0.00500995 1e-06 0.00045)
(0.005509945 1e-06 0.00045)
(0.00600994 1e-06 0.00045)
(0.006509935 1e-06 0.00045)
(0.00700993 1e-06 0.00045)
(0.007509925 1e-06 0.00045)
(0.00800992 1e-06 0.00045)
(0.008509915 1e-06 0.00045)
(0.00900991 1e-06 0.00045)
(0.009509905 1e-06 0.00045)
(0.0100099 1e-06 0.00045)
(0.010509895 1e-06 0.00045)
(0.01100989 1e-06 0.00045)
(0.011509885 1e-06 0.00045)
(0.01200988 1e-06 0.00045)
(0.012509875 1e-06 0.00045)
(0.01300987 1e-06 0.00045)
(0.013509865 1e-06 0.00045)
(0.01400986 1e-06 0.00045)
(0.014509855 1e-06 0.00045)
(0.01500985 1e-06 0.00045)
(0.015509845 1e-06 0.00045)
(0.01600984 1e-06 0.00045)
(0.016509835 1e-06 0.00045)
(0.01700983 1e-06 0.00045)
(0.017509825 1e-06 0.00045)
(0.01800982 1e-06 0.00045)
(0.018509815 1e-06 0.00045)
(0.01900981 1e-06 0.00045)
(0.019509805 1e-06 0.00045)
(0.0200098 1e-06 0.00045)
(0.020509795 1e-06 0.00045)
(0.02100979 1e-06 0.00045)
(0.021509785 1e-06 0.00045)
(0.02200978 1e-06 0.00045)
(0.022509775 1e-06 0.00045)
(0.02300977 1e-06 0.00045)
(0.023509765 1e-06 0.00045)
(0.02400976 1e-06 0.00045)
(0.024509755 1e-06 0.00045)
(0.02500975 1e-06 0.00045)
(0.025509745 1e-06 0.00045)
(0.02600974 1e-06 0.00045)
(0.026509735 1e-06 0.00045)
(0.02700973 1e-06 0.00045)
(0.027509725 1e-06 0.00045)
(0.02800972 1e-06 0.00045)
(0.028509715 1e-06 0.00045)
(0.02900971 1e-06 0.00045)
(0.029509705 1e-06 0.00045)
(0.0300097 1e-06 0.00045)
(0.030509695 1e-06 0.00045)
(0.03100969 1e-06 0.00045)
(0.031509685 1e-06 0.00045)
(0.03200968 1e-06 0.00045)
(0.032509675 1e-06 0.00045)
(0.03300967 1e-06 0.00045)
(0.033509665 1e-06 0.00045)
(0.03400966 1e-06 0.00045)
(0.034509655 1e-06 0.00045)
(0.03500965 1e-06 0.00045)
(0.035509645 1e-06 0.00045)
(0.03600964 1e-06 0.00045)
(0.036509635 1e-06 0.00045)
(0.03700963 1e-06 0.00045)
(0.037509625 1e-06 0.00045)
(0.03800962 1e-06 0.00045)
(0.038509615 1e-06 0.00045)
(0.03900961 1e-06 0.00045)
(0.039509605 1e-06 0.00045)
(0.0400096 1e-06 0.00045)
(0.040509595 1e-06 0.00045)
(0.04100959 1e-06 0.00045)
(0.041509585 1e-06 0.00045)
(0.04200958 1e-06 0.00045)
(0.042509575 1e-06 0.00045)
(0.04300957 1e-06 0.00045)
(0.043509565 1e-06 0.00045)
(0.04400956 1e-06 0.00045)
(0.044509555 1e-06 0.00045)
(0.04500955 1e-06 0.00045)
(0.045509545 1e-06 0.00045)
(0.04600954 1e-06 0.00045)
(0.046509535 1e-06 0.00045)
(0.04700953 1e-06 0.00045)
(0.047509525 1e-06 0.00045)
(0.04800952 1e-06 0.00045)
(0.048509515 1e-06 0.00045)
(0.04900951 1e-06 0.00045)
...
)