cases/2d_detonation_C7H16/constant/back/reaction.inp
elements        List<word> 
5
(
H
O
C
N
Ar
)
;

species         List<word> 
5
(
C7H16
O2
N2
CO2
H2O
)
;

reactions
{
    un-named-reaction-0
    {
        type            irreversibleArrheniusReaction;
        reaction        "C7H16^0.25 + 11O2^1.5 = 7CO2 + 8H2O";
        A               2811706.626;
        beta            0;
        Ta              7940.357749;
    }
}

Tlow            200;
Thigh           6000;
