cases/2d_detonation_C7H16/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleInternalEnergy;
    equationOfState perfectGas;
    specie          specie;
}


chemistryReader foamChemistryReader;

//foamChemistryFile "$FOAM_CASE/constant/reactions";

//foamChemistryThermoFile "$FOAM_CASE/constant/speciesThermo";

foamChemistryFile "$FOAM_CASE/constant/C7H16_Liu_s46r115.OFchem";

foamChemistryThermoFile "$FOAM_CASE/constant/C7H16_Liu_s46r115.OFthermo";

newFormat       yes;

inertSpecie     N2;

liquids
{
    C7H16;
}

solids
{}




// ************************************************************************* //
