cases/2d_detonation_C7H16/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 301
    volScalarFieldValue p 101325
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.005 0.015 0.000945);
        fieldValues
        (
            volScalarFieldValue C7H16 0.0621
            volScalarFieldValue N2 0.7193
            volScalarFieldValue O2 0.2186
            volScalarFieldValue T 2500
            volScalarFieldValue p 7092750
        );
    }
    boxToCell
    {
        box (0 0.019 0) (0.005 0.034 0.000945);
        fieldValues
        (
            volScalarFieldValue C7H16 0.0621
            volScalarFieldValue N2 0.7193
            volScalarFieldValue O2 0.2186
            volScalarFieldValue T 2500
            volScalarFieldValue p 7092750
        );
    }
    boxToCell
    {
        box (0 0.038 0) (0.005 0.053 0.000945);
        fieldValues
        (
            volScalarFieldValue C7H16 0.0621
            volScalarFieldValue N2 0.7193
            volScalarFieldValue O2 0.2186
            volScalarFieldValue T 2500
            volScalarFieldValue p 7092750
        );
    }
);


// ************************************************************************* //
